Repository: nadavyigal/ResumeBuilder-IOS-APP
Catalog: ResumeBuilder IOS APP/Resources/Localizable.xcstrings
Source language: en
Languages: he

source: Lock in your progress
he: שמרו את ההתקדמות שלכם

source: Low
he: נמוך

source: Low match. Improve role keywords, title fit, metrics, and section coverage before submitting.
he: התאמה נמוכה. שפר מילות מפתח לתפקיד, התאמת תפקיד, מדדים וכיסוי מקטעים לפני ההגשה.

source: Mail
he: דואר

source: Main issues
he: בעיות עיקריות

source: Make it look the part
he: תנו לזה את המראה הנכון

source: Mark as Applied
he: סמן כהוגש

source: Marking…
he: מסמן…

source: Master Resume
he: קורות חיים ראשיים

source: Match
he: התאמה

source: Match Deep Report
he: דוח התאמה מעמיק

source: Match Score
he: ציון התאמה

source: Match Score %lld percent
he: ציון התאמה %1$lld אחוז

source: Match breakdown
he: פירוט התאמה

source: Match improvements applied. Review the resume before submitting.
he: שיפורי התאמה הוחלו. סקור את קורות החיים לפני ההגשה.

source: Match insights
he: תובנות התאמה

source: Match keywords
he: מילות מפתח להתאמה

source: Matching your experience to this role.
he: מתאים את הניסיון שלך לתפקיד זה.

source: Maybe later
he: אולי מאוחר יותר

source: Me
he: אזור אישי

source: Measurable outcomes may be light
he: ייתכן שהתוצאות המדידות מעטות

source: Medium
he: בינוני

source: Medium priority
he: עדיפות בינונית

source: Message is too long (max %lld characters).
he: ההודעה ארוכה מדי (מקסימום %lld תווים).

source: Missing 7 required keywords from the job post
he: חסרות 7 מילות מפתח נדרשות מהמשרה

source: Missing Keywords
he: מילות מפתח חסרות

source: Missing keywords
he: מילות מפתח חסרות

source: Missing metrics
he: חסרים מדדים

source: Missing product analytics keywords
he: חסרות מילות מפתח של אנליטיקת מוצר

source: Missing purchase details.
he: חסרים פרטי רכישה.

source: Missing role-specific keywords
he: חסרות מילות מפתח יעודיות לתפקיד

source: Missing terms
he: מונחים חסרים

source: Mobile UX
he: חוויית משתמש מובייל

source: Mobile ready
he: מוכן למובייל

source: Moderate
he: בינוני

source: Modern
he: מודרני

source: Modification History
he: היסטוריית שינויים

source: More aligned with the target role wording.
he: מותאם יותר לניסוח של תפקיד היעד.

source: More aligned with this job — not a guarantee of interviews or ATS outcomes.
he: מותאם יותר למשרה זו — לא הבטחה לראיונות או לתוצאות ATS.

source: More measurable achievements
he: יותר הישגים מדידים

source: Most recruiters scan a resume in about 7 seconds — here's what they'd notice.
he: רוב המגייסים סורקים קורות חיים בכ-7 שניות — הנה מה שהם יבחינו בו.

source: Move revenue impact into the first 8 words
he: העבר את השפעת ההכנסות ל-8 המילים הראשונות

source: My Applications
he: המועמדויות שלי

source: My Resume
he: קורות החיים שלי

source: My Resumely Match Score was %lld%% for this job — try Resumely: %@
he: ציון ההתאמה שלי ב-Resumely היה %1$lld%% למשרה הזו — נסו את Resumely: %2$@

source: My resume
he: קורות החיים שלי

source: Needs another try
he: נדרש ניסיון נוסף

source: Needs keyword and skills alignment
he: דורש התאמת מילות מפתח וכישורים

source: Needs tighter role positioning
he: דורש מיצוב תפקיד הדוק יותר

source: Needs work
he: דורש שיפור

source: Needs your input
he: דורש את הקלט שלך

source: New job
he: משרה חדשה

source: Nice to have
he: טוב שיהיה

source: No bullet rewrites generated. Add concrete metrics in Expert Input and run again.
he: לא נוצרו שכתובי שורות. הוסף מדדים מוחשיים בקלט המומחה והרץ שוב.

source: No cover letter variants generated.
he: לא נוצרו גרסאות מכתב מלווה.

source: No expert analysis yet
he: אין עדיין ניתוח מומחה

source: No job link attached
he: לא צורף קישור משרה

source: No job link is attached yet. Add the job URL before saving so the package can track this application.
he: לא צורף קישור משרה. הוסף את קישור המשרה לפני השמירה כדי שהחבילה תוכל לעקוב אחרי ההגשה הזו.

source: No matching optimizations
he: אין אופטימיזציות תואמות

source: No missing keyword list was returned yet. Review the top gaps and use the job description as the source of truth.
he: טרם הוחזרה רשימת מילות מפתח חסרות. סקור את הפערים העיקריים והשתמש בתיאור המשרה כמקור האמת.

source: No modifications yet
he: אין עדיין שינויים

source: No optimizations
he: אין אופטימיזציות

source: No optimizations yet
he: אין עדיין אופטימיזציות

source: No optimized resume yet
he: אין עדיין קורות חיים מוטבים

source: No optimized resume yet.
he: אין עדיין קורות חיים מוטבים.

source: No saved resumes
he: אין קורות חיים שמורים

source: No screening answers generated.
he: לא נוצרו תשובות לשאלות סינון.

source: No section selected
he: לא נבחר מקטע

source: No summary options generated.
he: לא נוצרו אפשרויות תקציר.

source: No templates available
he: אין תבניות זמינות

source: Not complete
he: לא הושלם

source: Not now
he: לא עכשיו

source: Not signed in
he: לא מחובר

source: Not yet
he: עדיין לא

source: Not yet exported
he: טרם יוצא

source: OK
he: אישור

source: Open Resume Link
he: פתח קישור קורות חיים

source: Opens the Home tab
he: פתיחת לשונית הבית

source: Opens the Match breakdown pillars.
he: פותח את עמודי פירוט ההתאמה.

source: Opens the four match pillars with animations.
he: פותח את ארבעת עמודי ההתאמה עם אנימציות.

source: Opens the iOS Files picker
he: פתיחת בורר הקבצים של iOS

source: Optimization Review
he: סקירת אופטימיזציה

source: Optimization did not return a result. Try again.
he: האופטימיזציה לא החזירה תוצאה. נסה שוב.

source: Optimization id missing — return and run Optimize first.
he: חסר מזהה אופטימיזציה — חזור והרץ אופטימיזציה תחילה.

source: Optimization is not ready yet.
he: האופטימיזציה אינה מוכנה עדיין.

source: Optimization not available.
he: האופטימיזציה אינה זמינה.

source: Optimize
he: אופטימיזציה

source: Optimize a resume to preview
he: בצע אופטימיזציה לקורות חיים לתצוגה מקדימה

source: Optimize for This Job
he: אופטימיזציה למשרה זו

source: Optimize for another job
he: התאמה למשרה נוספת

source: Optimized
he: מוטב

source: Optimized Resume
he: קורות חיים מוטבים

source: Optimized resume
he: קורות חיים מוטבים

source: Optimized resume tab
he: לשונית קורות חיים מוטבים

source: Optimizing your resume
he: מבצע אופטימיזציה לקורות החיים שלך

source: Optimizing…
he: מבצע אופטימיזציה…

source: Optional details to mention
he: פרטים אופציונליים להזכרה

source: Optional: add tone preference, specific points, or unique selling points to include
he: אופציונלי: הוסף העדפת טון, נקודות ספציפיות או נקודות מכירה ייחודיות לכלול

source: Or paste job description here
he: או הדבק תיאור משרה כאן

source: Or paste the job description
he: או הדבק את תיאור המשרה

source: Original
he: מקור

source: Original bullet unavailable
he: השורה המקורית אינה זמינה

source: Over 5 MB
he: מעל 5 MB

source: Overview
he: סקירה כללית

source: PDF Ready
he: ה-PDF מוכן

source: PDF export
he: ייצוא PDF

source: PDF export failed: %@
he: ייצוא PDF נכשל: %@

source: PDF exported successfully
he: ה-PDF יוצא בהצלחה

source: PDF generated and ready
he: ה-PDF נוצר ומוכן

source: PDF only
he: PDF בלבד

source: PDF or DOCX · up to 5 MB
he: PDF או DOCX · עד 5 MB

source: PDF or DOCX, up to 5 MB. We'll extract the text so it stays readable for common parsers.
he: PDF או DOCX, עד 5 MB. נחלץ את הטקסט כדי שיישאר קריא למערכות סריקה נפוצות.

source: PDF, up to 5 MB
he: PDF, עד 5 MB

source: Package
he: חבילה

source: Package Contents
he: תכולת החבילה

source: Package not complete
he: החבילה לא הושלמה

source: Package ready
he: החבילה מוכנה

source: Password
he: סיסמה

source: Password must be at least 6 characters.
he: הסיסמה חייבת להכיל לפחות 6 תווים.

source: Paste a job description or add a job link.
he: הדבק תיאור משרה או הוסף קישור למשרה.

source: Paste a job to reveal missing keywords
he: הדבק משרה כדי לחשוף מילות מפתח חסרות

source: Paste at least 100 words from the job description (%lld of 100 words).
he: הדביקו לפחות 100 מילים מתיאור המשרה (%lld מתוך 100 מילים).

source: Paste résumé text
he: הדבק טקסט קורות חיים

source: Paste text
he: הדבק טקסט

source: Paste the complete job description for an accurate result.
he: הדבק את תיאור המשרה המלא לקבלת תוצאה מדויקת.

source: Paste the full job description (at least 100 words) so we can check your fit accurately.
he: הדבק את תיאור המשרה המלא (לפחות 100 מילים) כדי שנוכל לבדוק את ההתאמה שלך במדויק.

source: Paste the full job description or add a job link so we can check your fit accurately.
he: הדביקו את תיאור המשרה המלא או הוסיפו קישור למשרה כדי שנוכל לבדוק את ההתאמה במדויק.

source: Paste the job description below. We'll estimate your fit before you spend time optimizing.
he: הדבק את תיאור המשרה למטה. נעריך את ההתאמה שלך לפני שתשקיע זמן באופטימיזציה.

source: Paste the job description here if the link is unavailable…
he: הדבק את תיאור המשרה כאן אם הקישור אינו זמין…

source: Paste the job description here…
he: הדבק כאן את תיאור המשרה…

source: Paste the text instead
he: הדבקת הטקסט במקום

source: Paywall — coming soon
he: מסך תשלום — בקרוב

source: Placement suggestions
he: הצעות מיקום

source: Please sign in first.
he: התחבר תחילה.

source: Please try again.
he: אנא נסה שוב.

source: Polish
he: ליטוש

source: Positioning is easier to scan in the first few seconds.
he: המיצוב קל יותר לסריקה בשניות הראשונות.

source: Potential after optimization: about %lld%%
he: פוטנציאל לאחר אופטימיזציה: כ-%1$lld%%

source: Premium subscription required to run expert modes.
he: נדרש מנוי פרימיום כדי להריץ מצבי מומחה.

source: Preparing your diagnosis
he: מכין את האבחון שלך

source: Preparing…
he: מכין…

source: Preview
he: תצוגה מקדימה

source: Preview & Export
he: תצוגה וייצוא

source: Preview & Export PDF
he: תצוגה וייצוא PDF

source: Preview and export your PDF
he: תצוגה מקדימה וייצוא ה-PDF שלך

source: Preview is locked until you optimize a resume
he: התצוגה המקדימה נעולה עד שתבצעו אופטימיזציה לקורות החיים

source: Preview unavailable
he: התצוגה המקדימה אינה זמינה

source: Preview unavailable. Try downloading the PDF instead.
he: התצוגה המקדימה אינה זמינה. נסה להוריד את ה-PDF במקום.

source: Priority actions
he: פעולות בעדיפות

source: Privacy Policy
he: מדיניות פרטיות

source: Product is not available.
he: המוצר אינו זמין.

source: Progress path. Upload, add job, match.
he: מסלול התקדמות. העלאה, הוספת משרה, התאמה.

source: Purchase cancelled.
he: הרכישה בוטלה.

source: Purchase could not be verified.
he: לא ניתן היה לאמת את הרכישה.

source: Purchase failed.
he: הרכישה נכשלה.

source: Purchase is pending approval.
he: הרכישה ממתינה לאישור.

source: Quantify achievements
he: כמת הישגים

source: Quick Wins
he: ניצחונות מהירים

source: Quick improvement
he: שיפור מהיר

source: Quick wins
he: ניצחונות מהירים

source: RECRUITER-READY
he: מוכן למגייסים

source: Re-run %@
he: הרץ שוב %@

source: Re-scan resume
he: סרוק קורות חיים מחדש

source: Re-scanning…
he: סורק מחדש…

source: Reading your resume, comparing it to the job, and preparing recruiter-style feedback.
he: קורא את קורות החיים, משווה למשרה ומכין משוב בסגנון מגייס.

source: Ready for a free Match check
he: מוכנים לבדיקת התאמה חינם

source: Ready for full optimization.
he: מוכן לאופטימיזציה מלאה.

source: Ready for your resume diagnosis
he: מוכן לאבחון קורות החיים שלך

source: Recency & professional timeline alignment
he: עדכניות והתאמת ציר זמן מקצועי

source: Recent Activity
he: פעילות אחרונה

source: Recent Exports
he: ייצואים אחרונים

source: Recommendation
he: המלצה

source: Recommended
he: מומלץ

source: Recruiter 7-second view
he: מבט המגייס ב-7 שניות

source: Recruiter-ready templates, one tap.
he: תבניות מוכנות למגייסים בלחיצה אחת.

source: Recruiters scan for scope, numbers, and business context.
he: מגייסים סורקים אחר היקף, מספרים והקשר עסקי.

source: Redesign
he: עיצוב מחדש

source: Refine
he: ליטוש

source: Refine Resume
he: לטש קורות חיים

source: Refine failed
he: הליטוש נכשל

source: Refinement Instruction
he: הוראת ליטוש

source: Reject
he: דחה

source: Relevant background
he: רקע רלוונטי

source: Rendering preview…
he: מעבד תצוגה מקדימה…

source: Replace passive verbs with shipped outcomes
he: החלף פעלים סבילים בתוצאות שסופקו

source: Report loaded — full fidelity may require re-run.
he: הדוח נטען — נאמנות מלאה עשויה לדרוש הרצה מחדש.

source: Resume
he: קורות חיים

source: Resume Builder
he: בונה קורות חיים

source: Resume Diagnosis
he: אבחון קורות חיים

source: Resume Health Score
he: ציון בריאות קורות החיים

source: Resume Library is not available yet.
he: ספריית קורות החיים אינה זמינה עדיין.

source: Resume Match Score
he: ציון התאמת קורות החיים

source: Resume PDF
he: PDF קורות חיים

source: Resume Rewrite
he: שכתוב קורות חיים

source: Resume diagnosis
he: אבחון קורות חיים

source: Resume exported successfully
he: קורות החיים יוצאו בהצלחה

source: Resume gap
he: פער בקורות החיים

source: Resume section
he: מקטע בקורות החיים

source: ResumeBuilder IOS APP
he: Resumely

source: Resumely Match Score
he: ציון ההתאמה של Resumely

source: Resumes you save after uploading will appear here.
he: קורות חיים שתשמור לאחר העלאה יופיעו כאן.

source: Retry
he: נסה שוב

source: Retry now
he: נסו שוב עכשיו

source: Return after running Optimize to unlock expert workflows.
he: חזור לאחר הרצת אופטימיזציה כדי לפתוח תהליכי מומחה.

source: Revert
he: שחזר

source: Revert failed
he: השחזור נכשל

source: Review
he: סקירה

source: Review Changes
he: סקור שינויים

source: Review changes before approving
he: סקור שינויים לפני אישור

source: Review every edit for factual accuracy before submitting.
he: בדוק כל עריכה לדיוק עובדתי לפני ההגשה.

source: Review the diagnosis, preview the PDF, or refine further.
he: סקור את האבחון, צפה ב-PDF או המשך ללטש.

source: Review the resume, cover letter, and job link. Save this package to Me when it is ready.
he: סקור את קורות החיים, המכתב המלווה וקישור המשרה. שמור חבילה זו ב-אזור האישי כשהיא מוכנה.

source: Review the target job and tighten the summary.
he: סקור את משרת היעד והדק את התקציר.

source: Review this area before submitting.
he: סקור אזור זה לפני ההגשה.

source: Rewrite summary for mobile product
he: שכתב תקציר למוצר מובייל

source: Rewrite the summary and strongest bullets around the target job.
he: שכתב את התקציר ואת השורות החזקות ביותר סביב משרת היעד.

source: Rewrite the summary around the exact target role.
he: שכתב את התקציר סביב תפקיד היעד המדויק.

source: Rewrite the summary around the target job.
he: שכתב את התקציר סביב משרת היעד.

source: Rewrites the entire resume to match the job description with ATS-friendly structure and role-fit language.
he: משכתב את כל קורות החיים כדי להתאים לתיאור המשרה עם מבנה ידידותי ל-ATS ושפה מותאמת לתפקיד.

source: Risk
he: סיכון

source: Role
he: תפקיד

source: Role and company were not detected. You can edit them, or the package will use safe placeholders.
he: התפקיד והחברה לא זוהו. תוכל לערוך אותם, או שהחבילה תשתמש במצייני מקום בטוחים.

source: Role positioning looks serviceable
he: מיצוב התפקיד נראה סביר

source: Role targeting needs sharpening
he: מיקוד התפקיד דורש חידוד

source: Role was not detected. You can edit it, or the package will use Target Role.
he: התפקיד לא זוהה. תוכל לערוך אותו, או שהחבילה תשתמש ב"תפקיד יעד".

source: Role-fit rewrite with ATS-friendly structure.
he: שכתוב מותאם לתפקיד עם מבנה ידידותי ל-ATS.

source: Run
he: הרץ

source: Run %@
he: הרץ %1$@

source: Run Again
he: הרץ שוב

source: Run Free Match Check
he: הרץ בדיקת התאמה חינם

source: Run Improve match for a focused keyword and metrics pass.
he: הרץ "שפר התאמה" למעבר ממוקד של מילות מפתח ומדדים.

source: Run Optimize first to attach a version here.
he: הרץ אופטימיזציה תחילה כדי לצרף גרסה כאן.

source: Run Optimize first to create an optimization, then rescan.
he: הרץ אופטימיזציה תחילה כדי ליצור אופטימיזציה, ואז סרוק מחדש.

source: Run Optimize on Home to unlock expert workflows.
he: הרץ אופטימיזציה במסך הבית כדי לפתוח תהליכי מומחה.

source: Run Optimize once
he: הריצו אופטימיזציה פעם אחת

source: Run a scan and optimization to see it here.
he: הרץ סריקה ואופטימיזציה כדי לראות זאת כאן.

source: Run expert workflows for this optimization
he: הרץ תהליכי מומחה לאופטימיזציה זו

source: Running
he: מריץ

source: Résumé selected
he: קורות החיים נבחרו

source: Résumé selected. Choose a different file.
he: קורות החיים נבחרו. בחר קובץ אחר.

source: Résumés usually live in
he: קורות חיים נמצאים בדרך כלל ב-

source: SCORE
he: ציון

source: Save
he: שמור

source: Save Answers
he: שמור תשובות

source: Save Cover Letter
he: שמור מכתב מלווה

source: Save Package to Me
he: שמור חבילה לאזור האישי

source: Save Version
he: שמור גרסה

source: Save free so you don't lose this
he: שמרו בחינם כדי לא לאבד את זה

source: Save this resume?
he: לשמור קורות חיים אלה?

source: Save to Files app
he: שמור לאפליקציית קבצים

source: Save to reuse on other jobs without re-uploading.
he: שמור כדי להשתמש שוב במשרות אחרות ללא העלאה מחדש.

source: Save your %lld
he: שמרו את ה-%lld שלכם

source: Save your progress
he: שמור את ההתקדמות שלך

source: Saved Report
he: דוח שמור

source: Saved Reports
he: דוחות שמורים

source: Saved Resumes
he: קורות חיים שמורים

source: Saved internally in Me. Nothing was sent automatically; you can share the resume, copy the cover letter, or open the job link when you are ready.
he: נשמר פנימית באזור האישי. שום דבר לא נשלח אוטומטית; אפשר לשתף את קורות החיים, להעתיק את המכתב המלווה או לפתוח את קישור המשרה כשתהיה מוכן.

source: Saved resume
he: קורות חיים שמורים

source: Saved resumes unavailable
he: קורות חיים שמורים אינם זמינים

source: Saved to Me
he: נשמר באזור האישי

source: Saving
he: שומר

source: Saving does not change your resume text.
he: שמירה אינה משנה את טקסט קורות החיים שלך.

source: Scan Resume
he: סרוק קורות חיים

source: Scanning like a recruiter would
he: סורקים כפי שמגייס היה סורק

source: Scanning your resume
he: סורק את קורות החיים שלך

source: Score signals
he: אותות ציון

source: Scores are still loading.
he: הציונים עדיין נטענים.

source: Screening Answers
he: תשובות לשאלות סינון

source: Search job title or company
he: חפש תפקיד או חברה

source: Search title or company
he: חפש תפקיד או חברה

source: Section checks
he: בדיקות מקטעים

source: Section coverage & simple-to-parse layout
he: כיסוי מקטעים ופריסה פשוטה לפענוח

source: See a real diagnosis in 20 seconds
he: קבלו אבחון אמיתי בתוך 20 שניות

source: See all %lld fixes to keep climbing.
he: הציגו את כל %lld התיקונים כדי להמשיך להשתפר.

source: See what a recruiter may notice in 7 seconds, then get the next fix.
he: ראה מה מגייס עשוי לשים לב תוך 7 שניות, ואז קבל את התיקון הבא.

source: See what a recruiter notices in the first 7 seconds — then fix it.
he: ראו במה מגייס מבחין ב-7 השניות הראשונות — ואז תקנו זאת.

source: See what's blocking this resume
he: ראה מה חוסם את קורות החיים האלה

source: See your Match Score before signing in
he: ראו את ציון ההתאמה שלכם לפני ההתחברות

source: See your Match estimate before signing in, then unlock the full diagnosis.
he: ראו את אומדן ההתאמה שלכם לפני ההתחברות, ואז פתחו את האבחון המלא.

source: See your résumé like a recruiter does
he: ראה את קורות החיים שלך כמו שמגייס רואה אותם

source: Select at least one change to apply.
he: בחר לפחות שינוי אחד להחלה.

source: Selected resume file could not be found. Please choose it again from Files.
he: קובץ קורות החיים שנבחר לא נמצא. בחר אותו שוב מאפליקציית קבצים.

source: Selected resume file is empty. Please choose a freshly exported PDF.
he: קובץ קורות החיים שנבחר ריק. בחר PDF מיוצא טרי.

source: Send message
he: שלח הודעה

source: Send via email or message
he: שלח בדוא״ל או בהודעה

source: Senior Product Designer needed to lead mobile flows, ATS-friendly resume systems, and measurable hiring outcomes.
he: דרוש מעצב מוצר בכיר להוביל תהליכי מובייל, מערכות קורות חיים ידידותל-ATS ותוצאות גיוס מדידות.

source: Server PDF unavailable — generated a local copy from your resume sections.
he: PDF מהשרת אינו זמין — נוצר עותק מקומי ממקטעי קורות החיים שלך.

source: Server error (%lld). Please try again later.
he: שגיאת שרת (%lld). נסה שוב מאוחר יותר.

# Server error (%lld): %@
source: Server error (%1$lld): %2$@
he: שגיאת שרת (%1$lld): %2$@

source: Share
he: שתף

source: Share PDF
he: שתף PDF

source: Share Resume PDF
he: שתף PDF קורות חיים

source: Share again
he: שתף שוב

source: Share it, apply, or keep improving in Optimized.
he: שתף, הגש או המשך לשפר במסך המוטב.

source: Share on LinkedIn
he: שיתוף ב-LinkedIn

source: Share score
he: שתף ציון

source: Sharpen impact metrics
he: חדד מדדי השפעה

source: Show less
he: הצג פחות

source: Show more
he: הצג עוד

source: Sign In
he: כניסה

source: Sign Out
he: התנתק

source: Sign Up
he: הרשמה

source: Sign in and optimize a resume to see it here.
he: התחבר ובצע אופטימיזציה לקורות חיים כדי לראות אותם כאן.

source: Sign in required to chat.
he: נדרשת התחברות לצ׳אט.

source: Sign in required.
he: נדרשת התחברות.

source: Sign in to Optimize
he: התחבר כדי לבצע אופטימיזציה

source: Sign in to apply changes.
he: התחבר כדי להחיל שינויים.

source: Sign in to delete optimization history.
he: התחבר כדי למחוק היסטוריית אופטימיזציה.

source: Sign in to download PDFs.
he: התחבר כדי להוריד קובצי PDF.

source: Sign in to load this review.
he: התחבר כדי לטעון סקירה זו.

source: Sign in to preview your resume.
he: התחבר כדי לראות תצוגה מקדימה של קורות החיים שלך.

source: Sign in to save optimizations and export PDFs
he: התחבר כדי לשמור אופטימיזציות ולייצא PDF

source: Sign in to track applications.
he: התחבר כדי לעקוב אחר מועמדויות.

source: Sign in to unlock full optimization and PDF export.
he: התחבר כדי לפתוח אופטימיזציה מלאה וייצוא PDF.

source: Sign in to unlock full optimization.
he: התחבר כדי לפתוח אופטימיזציה מלאה.

source: Sign in to unlock full resume optimization.
he: התחבר כדי לפתוח אופטימיזציה מלאה של קורות החיים.

source: Sign in to upload your resume.
he: התחבר כדי להעלות את קורות החיים שלך.

source: Sign in to view history
he: התחבר כדי לצפות בהיסטוריה

source: Sign in to view modification history.
he: התחבר כדי לצפות בהיסטוריית השינויים.

source: Skill coverage is reasonably aligned
he: כיסוי הכישורים מותאם באופן סביר

source: Skills
he: כישורים

source: Skills section is present
he: מקטע הכישורים קיים

source: Skills section is too generic for the role
he: מקטע הכישורים כללי מדי לתפקיד

source: Skip
he: דלג

source: Skip — Browse Other Jobs
he: דלג — חפש משרות אחרות

source: Some role alignment is visible
he: ניכרת התאמה מסוימת לתפקיד

source: Soon
he: בקרוב

source: Spacing
he: ריווח

source: Start with resume + job
he: התחל עם קורות חיים + משרה

source: Status
he: סטטוס

source: Step 1 of 3
he: שלב 1 מתוך 3

source: Still low because %@. Improve these before submitting.
he: עדיין נמוך כי %@. שפר אותם לפני ההגשה.

source: Still low because the resume needs stronger role alignment, measurable outcomes, keywords, and section coverage for this job.
he: עדיין נמוך כי קורות החיים זקוקים להתאמת תפקיד חזקה יותר, תוצאות מדידות, מילות מפתח וכיסוי מקטעים למשרה זו.

source: StoreKit wiring is scaffolded and intentionally left minimal in this pass.
he: חיבור StoreKit מוכן והושאר מינימלי בכוונה בשלב זה.

source: Story, tone, completeness & leadership signals.
he: סיפור, טון, שלמות ואותות מנהיגות.

source: Strengthen summary
he: חזק את התקציר

source: Strengths
he: חוזקות

source: Stretch Fit
he: התאמה עם מאמץ

source: Strong Fit
he: התאמה חזקה

source: Strong match for this role. Keep edits truthful before applying.
he: התאמה חזקה לתפקיד זה. שמור על עריכות נכונות לפני ההחלה.

source: Strong — polish it
he: חזק — נשאר רק ללטש

source: Stronger because it uses target-role language already present in the optimized resume. Review every fact before submitting.
he: חזק יותר כי הוא משתמש בשפת תפקיד היעד שכבר קיימת בקורות החיים המוטבים. בדוק כל עובדה לפני ההגשה.

source: Stronger bullets connect actions to context and impact.
he: שורות חזקות יותר מקשרות פעולות להקשר ולהשפעה.

source: Submission Package
he: חבילת הגשה

source: Submit Package
he: הגש חבילה

source: Submit at Job Link
he: הגש בקישור המשרה

source: Subscores
he: תת-ציונים

source: Suggested
he: מוצע

source: Suggested place to look for your résumé
he: מקום מומלץ לחיפוש קורות החיים שלכם
